# IsValidPersistentIdsMap Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilder..::..IsValidPersistentIdsMap Method
BRepBuilder Class See Also
---
A validator function that makes sure that all BRepBuilderGeometryIds in the input map can be found in this BRepBuilder object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsValidPersistentIdsMap(
	BRepBuilderPersistentIds brepPersistentIds
)
```

Visual Basic
---
```text
Public Function IsValidPersistentIdsMap ( _
	brepPersistentIds As BRepBuilderPersistentIds _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidPersistentIdsMap(
	BRepBuilderPersistentIds^ brepPersistentIds
)
```

# ### Parameters
brepPersistentIds
    Type: Autodesk.Revit.DB..::..BRepBuilderPersistentIds The map that associates ExternalGeometryIds to BRepBuilderGeometryIds.
# ### Return Value
True if all BRepBuilderGeometryIds in the input map can be found in this BRepBuilder object, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace